https://blog.naver.com/ehrtk2002/221928574758

예전에 SQl 연습문제 푼거 쥬피터로 옴겨옴

In [6]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Collecting prettytable (from ipython-sql)
  Downloading prettytable-3.7.0-py3-none-any.whl (27 kB)
Requirement already satisfied: ipython in c:\users\jang_home\python311\lib\site-packages (from ipython-sql) (8.12.0)
Collecting sqlalchemy>=2.0 (from ipython-sql)
  Downloading SQLAlchemy-2.0.11-cp311-cp311-win_amd64.whl (2.0 MB)
                                              0.0/2.0 MB ? eta -:--:--
     ---------------------------------------  2.0/2.0 MB 61.1 MB/s eta 0:00:01
     ---------------------------------------- 2.0/2.0 MB 41.6 MB/s eta 0:00:00
Collecting sqlparse (from ipython-sql)
  Downloading sqlparse-0.4.4-py3-none-any.whl (41 kB)
                                              0.0/41.2 kB ? eta -:--:--
     ---------------------------------------- 41.2/41.2 kB ? eta 0:00:00
Requirement already satisfied: six in c:\users\jang_home\python311\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\jang_home\python311\lib\site-packages (from ipython-sql) (0.2.0)
Collecting typing-extensions>=4.2.0 (from sqlalchemy>=2.0->ipython-sql)
  Using cached typing_extensions-4.5.0-py3-none-any.whl (27 kB)
Collecting greenlet!=0.4.17 (from sqlalchemy>=2.0->ipython-sql)
  Downloading greenlet-2.0.2-cp311-cp311-win_amd64.whl (192 kB)
                                              0.0/192.5 kB ? eta -:--:--
     ------------------------------------- 192.5/192.5 kB 11.4 MB/s eta 0:00:00
Requirement already satisfied: backcall in c:\users\jang_home\python311\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\users\jang_home\python311\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\jang_home\python311\lib\site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: matplotlib-inline in c:\users\jang_home\python311\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pickleshare in c:\users\jang_home\python311\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in c:\users\jang_home\python311\lib\site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: pygments>=2.4.0 in c:\users\jang_home\python311\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in c:\users\jang_home\python311\lib\site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: traitlets>=5 in c:\users\jang_home\python311\lib\site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: colorama in c:\users\jang_home\python311\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\jang_home\python311\lib\site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\jang_home\python311\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing>=1.2.0 in c:\users\jang_home\python311\lib\site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\jang_home\python311\lib\site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: pure-eval in c:\users\jang_home\python311\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Installing collected packages: typing-extensions, sqlparse, prettytable, greenlet, sqlalchemy, ipython-sql
Successfully installed greenlet-2.0.2 ipython-sql-0.5.0 prettytable-3.7.0 sqlalchemy-2.0.11 sqlparse-0.4.4 typing-extensions-4.5.0

In [2]:
%load_ext sql
%sql sqlite:///example2.db

In [2]:
%%sql
CREATE TABLE DEPT (
    DEPTNO DECIMAL(2),
    DNAME VARCHAR(14),
    LOC VARCHAR(13),
    CONSTRAINT PK_DEPT PRIMARY KEY (DEPTNO) 
);
CREATE TABLE EMP (
    EMPNO DECIMAL(4),
    ENAME VARCHAR(10),
    JOB VARCHAR(9),
    MGR DECIMAL(4),
    HIREDATE DATE,
    SAL DECIMAL(7,2),
    COMM DECIMAL(7,2),
    DEPTNO DECIMAL(2),
    CONSTRAINT PK_EMP PRIMARY KEY (EMPNO),
    CONSTRAINT FK_DEPTNO FOREIGN KEY (DEPTNO) REFERENCES DEPT(DEPTNO)
);
CREATE TABLE SALGRADE ( 
    GRADE TINYINT,
    LOSAL SMALLINT,
    HISAL SMALLINT 
);
INSERT INTO DEPT VALUES (10,'ACCOUNTING','NEW YORK');
INSERT INTO DEPT VALUES (20,'RESEARCH','DALLAS');
INSERT INTO DEPT VALUES (30,'SALES','CHICAGO');
INSERT INTO DEPT VALUES (40,'OPERATIONS','BOSTON');
INSERT INTO EMP VALUES (7369,'SMITH','CLERK',7902,strftime('%Y-%m-%d','1980-12-17'),800,NULL,20);
INSERT INTO EMP VALUES (7499,'ALLEN','SALESMAN',7698,strftime('%Y-%m-%d','1981-02-20'),1600,300,30);
INSERT INTO EMP VALUES (7521,'WARD','SALESMAN',7698,strftime('%Y-%m-%d','1981-02-22'),1250,500,30);
INSERT INTO EMP VALUES (7566,'JONES','MANAGER',7839,strftime('%Y-%m-%d','1981-04-02'),2975,NULL,20);
INSERT INTO EMP VALUES (7654,'MARTIN','SALESMAN',7698,strftime('%Y-%m-%d','1981-09-28'),1250,1400,30);
INSERT INTO EMP VALUES (7698,'BLAKE','MANAGER',7839,strftime('%Y-%m-%d','1981-06-01'),2850,NULL,30);
INSERT INTO EMP VALUES (7782,'CLARK','MANAGER',7839,strftime('%Y-%m-%d','1981-06-09'),2450,NULL,10);
INSERT INTO EMP VALUES (7788,'SCOTT','ANALYST',7566,strftime('%Y-%m-%d','1987-07-13'),3000,NULL,20);
INSERT INTO EMP VALUES (7839,'KING','PRESIDENT',NULL,strftime('%Y-%m-%d','1981-11-17'),5000,NULL,10);
INSERT INTO EMP VALUES (7844,'TURNER','SALESMAN',7698,strftime('%Y-%m-%d','1981-09-08'),1500,0,30);
INSERT INTO EMP VALUES (7876,'ADAMS','CLERK',7788,strftime('%Y-%m-%d','1987-07-13'),1100,NULL,20);
INSERT INTO EMP VALUES (7900,'JAMES','CLERK',7698,strftime('%Y-%m-%d','1981-12-03'),950,NULL,30);
INSERT INTO EMP VALUES (7902,'FORD','ANALYST',7566,strftime('%Y-%m-%d','1981-12-03'),3000,NULL,20);
INSERT INTO EMP VALUES (7934,'MILLER','CLERK',7782,strftime('%Y-%m-%d','1982-01-23'),1300,NULL,10);
INSERT INTO SALGRADE VALUES (1,700,1200);
INSERT INTO SALGRADE VALUES (2,1201,1400);
INSERT INTO SALGRADE VALUES (3,1401,2000);
INSERT INTO SALGRADE VALUES (4,2001,3000);
INSERT INTO SALGRADE VALUES (5,3001,9999);

 * sqlite:///example2.db
(sqlite3.OperationalError) table DEPT already exists
[SQL: CREATE TABLE DEPT (
    DEPTNO DECIMAL(2),
    DNAME VARCHAR(14),
    LOC VARCHAR(13),
    CONSTRAINT PK_DEPT PRIMARY KEY (DEPTNO)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [3]:
%sql SELECT * FROM dept;

 * sqlite:///example2.db
Done.

[(10, 'ACCOUNTING', 'NEW YORK'),
 (20, 'RESEARCH', 'DALLAS'),
 (30, 'SALES', 'CHICAGO'),
 (40, 'OPERATIONS', 'BOSTON')]

In [8]:
%sql SELECT * FROM EMP where empno=7499;

 * sqlite:///example2.db
Done.

[(7499, 'ALLEN', 'SALESMAN', 7698, None, 1600, 300, 30)]

In [7]:
%sql SELECT * FROM EMP

 * sqlite:///example2.db
Done.

[(7369, 'SMITH', 'CLERK', 7902, '1980-12-17', 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '1981-02-20', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '1981-02-22', 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '1981-04-02', 2975, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '1981-09-28', 1250, 1400, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, '1981-06-01', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '1981-06-09', 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '1987-07-13', 3000, None, 20),
 (7839, 'KING', 'PRESIDENT', None, '1981-11-17', 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '1981-09-08', 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '1987-07-13', 1100, None, 20),
 (7900, 'JAMES', 'CLERK', 7698, '1981-12-03', 950, None, 30),
 (7902, 'FORD', 'ANALYST', 7566, '1981-12-03', 3000, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, '1982-01-23', 1300, None, 10)]

In [6]:
%sql SELECT * FROM SALGRADE;

 * sqlite:///example2.db
Done.

[(1, 700, 1200),
 (2, 1201, 1400),
 (3, 1401, 2000),
 (4, 2001, 3000),
 (5, 3001, 9999)]

In [36]:
# 데이터프레임으로 변경
import pandas as pd

result = %sql SELECT ENAME,HIREDATE FROM EMP
pd.DataFrame(result)

 * sqlite:///example2.db
Done.

     ENAME    HIREDATE
0    SMITH  1980-12-17
1    ALLEN  1981-02-20
2     WARD  1981-02-22
3    JONES  1981-04-02
4   MARTIN  1981-09-28
5    BLAKE  1981-06-01
6    CLARK  1981-06-09
7    SCOTT  1987-07-13
8     KING  1981-11-17
9   TURNER  1981-09-08
10   ADAMS  1987-07-13
11   JAMES  1981-12-03
12    FORD  1981-12-03
13  MILLER  1982-01-23